V1/Data/linkerd-2/120-3-wrk2-96ccf.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 32.321ms, rate sampling interval: 191ms
  Thread calibration: mean lat.: 31.709ms, rate sampling interval: 107ms
  Thread calibration: mean lat.: 34.780ms, rate sampling interval: 226ms
  Thread calibration: mean lat.: 30.766ms, rate sampling interval: 187ms
  Thread calibration: mean lat.: 31.578ms, rate sampling interval: 202ms
  Thread calibration: mean lat.: 19.608ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 36.539ms, rate sampling interval: 248ms
  Thread calibration: mean lat.: 30.342ms, rate sampling interval: 110ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.45ms   19.29ms 158.34ms   91.94%
    Req/Sec     4.96     32.54   500.00     96.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.41ms
 75.000%   24.80ms
 90.000%   35.42ms
 99.000%  105.92ms
 99.900%  148.10ms
 99.990%  157.95ms
 99.999%  158.46ms
100.000%  158.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.483     0.000000            1         1.00
      11.543     0.100000         1147         1.11
      12.703     0.200000         2297         1.25
      13.895     0.300000         3439         1.43
      15.431     0.400000         4587         1.67
      17.407     0.500000         5727         2.00
      18.735     0.550000         6305         2.22
      20.255     0.600000         6877         2.50
      21.775     0.650000         7447         2.86
      23.151     0.700000         8019         3.33
      24.799     0.750000         8592         4.00
      25.695     0.775000         8878         4.44
      26.943     0.800000         9165         5.00
      28.287     0.825000         9450         5.71
      30.079     0.850000         9737         6.67
      32.063     0.875000        10024         8.00
      33.343     0.887500        10166         8.89
      35.423     0.900000        10312        10.00
      39.135     0.912500        10451        11.43
      46.527     0.925000        10597        13.33
      56.543     0.937500        10738        16.00
      62.495     0.943750        10809        17.78
      69.567     0.950000        10881        20.00
      76.543     0.956250        10953        22.86
      82.687     0.962500        11025        26.67
      87.679     0.968750        11096        32.00
      90.111     0.971875        11131        35.56
      92.159     0.975000        11167        40.00
      94.975     0.978125        11204        45.71
      97.535     0.981250        11240        53.33
      99.775     0.984375        11276        64.00
     101.311     0.985938        11292        71.11
     102.591     0.987500        11310        80.00
     104.127     0.989062        11328        91.43
     107.135     0.990625        11346       106.67
     108.607     0.992188        11364       128.00
     110.079     0.992969        11373       142.22
     113.151     0.993750        11382       160.00
     117.439     0.994531        11391       182.86
     120.255     0.995313        11400       213.33
     127.487     0.996094        11409       256.00
     131.071     0.996484        11413       284.44
     135.295     0.996875        11419       320.00
     137.727     0.997266        11422       365.71
     139.903     0.997656        11427       426.67
     142.079     0.998047        11431       512.00
     142.463     0.998242        11433       568.89
     145.791     0.998437        11436       640.00
     147.199     0.998633        11439       731.43
     147.455     0.998828        11440       853.33
     148.095     0.999023        11442      1024.00
     148.223     0.999121        11444      1137.78
     148.607     0.999219        11445      1280.00
     151.807     0.999316        11446      1462.86
     152.703     0.999414        11447      1706.67
     154.111     0.999512        11448      2048.00
     154.111     0.999561        11448      2275.56
     154.623     0.999609        11449      2560.00
     154.879     0.999658        11450      2925.71
     154.879     0.999707        11450      3413.33
     155.775     0.999756        11451      4096.00
     155.775     0.999780        11451      4551.11
     155.775     0.999805        11451      5120.00
     157.951     0.999829        11452      5851.43
     157.951     0.999854        11452      6826.67
     157.951     0.999878        11452      8192.00
     157.951     0.999890        11452      9102.22
     157.951     0.999902        11452     10240.00
     158.463     0.999915        11453     11702.86
     158.463     1.000000        11453          inf
#[Mean    =       23.451, StdDeviation   =       19.286]
#[Max     =      158.336, Total count    =        11453]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12007 requests in 5.00m, 4.43MB read
  Socket errors: connect 0, read 0, write 0, timeout 18000
Requests/sec:     40.00
Transfer/sec:     15.12KB