V1/Data/linkerd-2/120-3-wrk2-fjmjk.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 20.953ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 20.969ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 21.961ms, rate sampling interval: 81ms
  Thread calibration: mean lat.: 23.772ms, rate sampling interval: 78ms
  Thread calibration: mean lat.: 17.742ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 20.949ms, rate sampling interval: 63ms
  Thread calibration: mean lat.: 19.376ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 22.700ms, rate sampling interval: 79ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.17ms   14.47ms 136.96ms   92.00%
    Req/Sec     4.97     35.95   694.00     97.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.39ms
 75.000%   21.90ms
 90.000%   30.37ms
 99.000%   88.96ms
 99.900%  127.17ms
 99.990%  136.83ms
 99.999%  137.09ms
100.000%  137.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.459     0.000000            1         1.00
      11.295     0.100000         1153         1.11
      12.311     0.200000         2297         1.25
      13.263     0.300000         3440         1.43
      14.263     0.400000         4580         1.67
      15.391     0.500000         5724         2.00
      16.103     0.550000         6298         2.22
      16.975     0.600000         6873         2.50
      18.287     0.650000         7438         2.86
      20.111     0.700000         8011         3.33
      21.903     0.750000         8583         4.00
      22.719     0.775000         8872         4.44
      23.631     0.800000         9159         5.00
      24.607     0.825000         9443         5.71
      25.743     0.850000         9732         6.67
      27.583     0.875000        10017         8.00
      28.799     0.887500        10158         8.89
      30.367     0.900000        10299        10.00
      32.991     0.912500        10444        11.43
      36.543     0.925000        10585        13.33
      42.719     0.937500        10728        16.00
      46.879     0.943750        10800        17.78
      50.047     0.950000        10871        20.00
      52.671     0.956250        10943        22.86
      56.607     0.962500        11014        26.67
      62.879     0.968750        11087        32.00
      66.879     0.971875        11122        35.56
      70.079     0.975000        11157        40.00
      74.047     0.978125        11193        45.71
      77.759     0.981250        11229        53.33
      80.959     0.984375        11265        64.00
      82.879     0.985938        11283        71.11
      84.735     0.987500        11300        80.00
      87.679     0.989062        11318        91.43
      89.471     0.990625        11336       106.67
      91.007     0.992188        11354       128.00
      92.223     0.992969        11363       142.22
      93.823     0.993750        11372       160.00
      95.807     0.994531        11381       182.86
      97.855     0.995313        11391       213.33
      98.815     0.996094        11399       256.00
      99.455     0.996484        11403       284.44
     100.799     0.996875        11408       320.00
     101.439     0.997266        11412       365.71
     103.871     0.997656        11417       426.67
     106.559     0.998047        11421       512.00
     109.823     0.998242        11423       568.89
     112.191     0.998437        11426       640.00
     117.439     0.998633        11428       731.43
     124.543     0.998828        11430       853.33
     127.167     0.999023        11432      1024.00
     127.295     0.999121        11433      1137.78
     131.583     0.999219        11435      1280.00
     131.839     0.999316        11436      1462.86
     135.039     0.999414        11437      1706.67
     135.295     0.999512        11438      2048.00
     135.295     0.999561        11438      2275.56
     135.807     0.999609        11439      2560.00
     136.063     0.999658        11440      2925.71
     136.063     0.999707        11440      3413.33
     136.575     0.999756        11441      4096.00
     136.575     0.999780        11441      4551.11
     136.575     0.999805        11441      5120.00
     136.831     0.999829        11442      5851.43
     136.831     0.999854        11442      6826.67
     136.831     0.999878        11442      8192.00
     136.831     0.999890        11442      9102.22
     136.831     0.999902        11442     10240.00
     137.087     0.999915        11443     11702.86
     137.087     1.000000        11443          inf
#[Mean    =       20.165, StdDeviation   =       14.467]
#[Max     =      136.960, Total count    =        11443]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12007 requests in 5.00m, 4.43MB read
  Socket errors: connect 0, read 0, write 0, timeout 18000
Requests/sec:     40.00
Transfer/sec:     15.12KB