V1/Data/linkerd-2/120-5-wrk2-x4wjl.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 18.920ms, rate sampling interval: 58ms
  Thread calibration: mean lat.: 19.318ms, rate sampling interval: 64ms
  Thread calibration: mean lat.: 21.168ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 18.658ms, rate sampling interval: 60ms
  Thread calibration: mean lat.: 19.242ms, rate sampling interval: 59ms
  Thread calibration: mean lat.: 22.199ms, rate sampling interval: 78ms
  Thread calibration: mean lat.: 20.230ms, rate sampling interval: 68ms
  Thread calibration: mean lat.: 19.864ms, rate sampling interval: 68ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.12ms   17.42ms 153.34ms   92.52%
    Req/Sec     4.95     27.79   327.00     96.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.34ms
 75.000%   22.22ms
 90.000%   31.34ms
 99.000%   98.18ms
 99.900%  139.26ms
 99.990%  148.86ms
 99.999%  153.47ms
100.000%  153.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.099     0.000000            1         1.00
      11.231     0.100000         1143         1.11
      12.159     0.200000         2285         1.25
      13.015     0.300000         3439         1.43
      13.967     0.400000         4570         1.67
      15.335     0.500000         5713         2.00
      16.295     0.550000         6288         2.22
      17.423     0.600000         6860         2.50
      18.847     0.650000         7427         2.86
      20.479     0.700000         8000         3.33
      22.223     0.750000         8569         4.00
      22.975     0.775000         8855         4.44
      23.903     0.800000         9145         5.00
      25.007     0.825000         9428         5.71
      26.271     0.850000         9712         6.67
      28.271     0.875000         9997         8.00
      29.647     0.887500        10141         8.89
      31.343     0.900000        10285        10.00
      33.407     0.912500        10426        11.43
      38.527     0.925000        10570        13.33
      49.055     0.937500        10711        16.00
      53.503     0.943750        10783        17.78
      60.479     0.950000        10854        20.00
      67.711     0.956250        10927        22.86
      73.535     0.962500        10997        26.67
      80.447     0.968750        11068        32.00
      82.943     0.971875        11106        35.56
      84.991     0.975000        11140        40.00
      87.679     0.978125        11176        45.71
      89.407     0.981250        11212        53.33
      92.159     0.984375        11249        64.00
      93.631     0.985938        11265        71.11
      95.295     0.987500        11284        80.00
      97.471     0.989062        11301        91.43
      98.751     0.990625        11318       106.67
     101.951     0.992188        11336       128.00
     104.255     0.992969        11345       142.22
     107.391     0.993750        11355       160.00
     109.375     0.994531        11363       182.86
     114.623     0.995313        11372       213.33
     116.863     0.996094        11381       256.00
     118.463     0.996484        11385       284.44
     121.407     0.996875        11390       320.00
     123.711     0.997266        11394       365.71
     126.847     0.997656        11399       426.67
     128.895     0.998047        11403       512.00
     129.663     0.998242        11405       568.89
     132.095     0.998437        11408       640.00
     133.375     0.998633        11410       731.43
     136.319     0.998828        11412       853.33
     139.263     0.999023        11414      1024.00
     139.775     0.999121        11415      1137.78
     141.311     0.999219        11417      1280.00
     142.079     0.999316        11418      1462.86
     142.975     0.999414        11419      1706.67
     143.615     0.999512        11420      2048.00
     143.615     0.999561        11420      2275.56
     143.999     0.999609        11421      2560.00
     145.663     0.999658        11422      2925.71
     145.663     0.999707        11422      3413.33
     148.735     0.999756        11423      4096.00
     148.735     0.999780        11423      4551.11
     148.735     0.999805        11423      5120.00
     148.863     0.999829        11424      5851.43
     148.863     0.999854        11424      6826.67
     148.863     0.999878        11424      8192.00
     148.863     0.999890        11424      9102.22
     148.863     0.999902        11424     10240.00
     153.471     0.999915        11425     11702.86
     153.471     1.000000        11425          inf
#[Mean    =       21.125, StdDeviation   =       17.420]
#[Max     =      153.344, Total count    =        11425]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12008 requests in 5.00m, 4.43MB read
  Socket errors: connect 0, read 0, write 0, timeout 18000
Requests/sec:     40.02
Transfer/sec:     15.13KB